Notes/daily/2021-10-28.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-10-28</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2021-10-28</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2021-11-03.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc472b4d">Today's task list</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc472b4d" class="outline-2">
<h2 id="orgc472b4d">Today's task list</h2>
<div class="outline-text-2" id="text-orgc472b4d">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Copy the PPR to documents
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Get permission from OCR to publish PPR</li>
<li class="off"><code>[&#xa0;]</code> Copy it over</li>
</ul></li>
<li class="on"><code>[X]</code> Go to Moodle and look at the 'Examples of projects from Hills students'.
<ul class="org-ul">
<li class="on"><code>[X]</code> Make notes on these examples
<ul class="org-ul">
<li>What are the strengths and weaknesses?</li>
<li>What can you learn from these?</li>
<li>How will this influence the way you work?</li>
</ul></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Add a link back to the main page from each page on the site, as well as a link to the source on github</li>
</ul>

<p>
I still haven't recieved a reply from OCR, so I can't complete task 1, so I'm starting with the second task.
</p>

<p>
<a href="../20211028133315-former_project_example_analysis.html#ID-1bb811a3-54ac-43e5-a2d6-6463efa56211">Former project example analysis</a> is stored in a separate note for easier access, please go there to see it.
</p>

<p>
As has become clear from doing the analysis, time management is an important part of the EPQ, so I'm therefore adding the following to my task list:
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Create a schedule of when the EPQ will be done (2hrs/w to start with)</li>
<li class="off"><code>[&#xa0;]</code> Create a kanban board (perhaps <a href="https://quire.io">quire</a> to start with?, or <a href="https://github.com/Minion3665/EPQ/projects">github projects to better integrate with the existing systems</a>)</li>
<li class="off"><code>[&#xa0;]</code> Create a timeline of when stuff should be done by, or add time estimates to the kanban board</li>
</ul>

<p>
These tasks should hopefully help me to estimate how much time will need to be used for my EPQ and find where that time will come from.
</p>

<p>
As a second part of this, I need to record how much time I'm actually spending on my EPQ, so I'm going to start timing this, starting now. I'm going to be using the builtin <a href="https://orgmode.org/manual/Timers.html">timer functionality</a> in orgmode (my note-taking program) to do this.
</p>

<p>
0:00:38 - Started work on task 3, adding links back to the main page &amp; source code on each page
1:19:22 - I've added a link to the homepage and a link to the latest note. Unfortunately it doesn't look like it'll be possible to add links to git, as orgmode doesn't give a way to get the directory of the current file
</p>
</div>
</div>
</div>
</body>
</html>
